{
  "en": {
    "nav": {
      "about": "About",
      "research": "Research",
      "publications": "Publications",
      "teaching": "Teaching",
      "members": "Members",
      "links": "Links",
      "contact": "Contact",
      "resources": "Resources",
      "news": "News"
    },
    "common": {
      "search": "Search",
      "search_placeholder": "Search...",
      "theme_toggle": "Switch Theme",
      "language_switch": "Switch Language",
      "skip_to_content": "Skip to main content",
      "home": "Home",
      "view_all": "View all",
      "read_more": "Read more",
      "back_to_top": "Back to top",
      "view_profile": "View Profile",
      "email": "Email"
    },
    "header": {
      "brand_title": "AG Computational Arithmetic Geometry",
      "university_name": "University of Heidelberg",
      "toggle_navigation": "Toggle navigation menu"
    },
    "about": {
      "title": "About",
      "description": "This is the website of the research group \"computational arithmetic geometry\" at the Interdisciplinary Center for Scientific Computing (IWR) in Heidelberg.",
      "content": "Within algebraic number theory and arithmetic geometry, the focus of the research group is on Galois representations, their relations to modular forms and elliptic curves, their deformation theory etc., as well as on some aspects of function field arithmetic such as L-functions and Drinfeld modular forms.",
      "methods": "To tackle problems in the themes described above, we apply a broad range of methods. On one hand we pursue these questions by purely theoretical methods. On the other, we use computer algebra to carry out experiments that help us gather examples for the theory or to solve particular questions that arise from the theory. Some members of our group have also developed routines on top of existing computer algebra packages.",
      "more_info": "A more detailed survey of our activities can be found in the research section and in the publications of our members.",
      "latest_news": "Latest News",
      "view_all_news": "View all news"
    },
    "research": {
      "title": "Research",
      "description": "The research of our group is in **arithmetic geometry** and **number theory**. Below are some of our key research areas and topics. For more details, click on any of the topics to see a detailed description, related papers, and resources.",
      "publications_link": "You can also browse the [publications]({{ '/publications' | relative_url }}) of our group members.",
      "intro_lead": "Our research focuses on the intersection of arithmetic geometry, Galois representations, and computational methods in number theory.",
      "intro_description": "We investigate Galois representations, modular forms, elliptic curves, and their connections to modern number theory. Our work combines theoretical insights with computational experiments to advance understanding in these areas.",
      "areas_title": "Research Areas",
      "methodology_title": "Methodology",
      "collaborations_title": "Collaborations",
      "collaborations_description": "We collaborate with researchers worldwide on various aspects of arithmetic geometry and computational number theory. Our group maintains active connections with:",
      "method_computational": {
        "title": "Computational Methods",
        "description": "We develop and use advanced computational techniques to explore arithmetic objects and verify theoretical predictions."
      },
      "method_theoretical": {
        "title": "Theoretical Analysis",
        "description": "Deep theoretical understanding guides our computational experiments and helps interpret their results."
      },
      "method_experimental": {
        "title": "Experimental Mathematics",
        "description": "We use computational experiments to discover patterns and formulate new conjectures in arithmetic geometry."
      },
      "collaboration_1": "International research institutions",
      "collaboration_2": "Mathematical software development teams",
      "collaboration_3": "Number theory conferences and workshops",
      "collaboration_4": "Graduate and undergraduate research programs",
      "learn_more": "Learn More",
      "papers_count": "papers",
      "galois_representations_title": "Galois representations and modular forms",
      "galois_representations_content": "A modern way to look at algebraic number theory is to study the group GQ of symmetries of all finite extension of the rational number Q, i.e. of all number fields. One way of doing this is via p-adic (or complex) Galois representations. These are homomorphisms from GQ to GLn(K) for (the complex or) a p-adic field K.",
      "galois_representations_approach": "If one would understand all these, one could deduce many results in number theory. The reason why this approach is promising is that the Langlands program predicts (conjectures) that many interesting Galois representation can be found in (arithmetic) geometry, for instance by studying modular forms or elliptic curves.",
      "fermat_theorem": "The most visible success of this method has been the proof of Fermat's last theorem by Wiles and Taylor-Wiles building on work of many others.",
      "drinfeld_title": "Drinfeld modular varieties and Drinfeld modular forms",
      "drinfeld_intro": "It has been observed that questions in number theory often have analogs over global function fields; then the ring of integers Z is replaced by rings like the polynomial ring Fp[t], and the field of rational numbers Q by the field of rational functions over the finite field Fp of p elements, where p is a prime number.",
      "drinfeld_methods": "Because methods from algebraic geometry can be applied to function fields, many questions over the latter are more tractable than the corresponding questions over number fields. One particular instance of this is Drinfeld's proof of the global Langlands correspondence for GL2 over function fields.",
      "drinfeld_varieties": "In his proof Drinfeld introduced what are now called Drinfeld modular varieties; these are function field analogs of certain Shimura varieties. Their cohomology gives rise to Galois representations and these varieties have an interesting geometry coming from their moduli interpretation."
    },
    "publications": {
      "title": "Publications",
      "description": "Publications by our research group members.",
      "intro": "Publications and preprints of our research group:",
      "group_members": "Group Members",
      "group_leader": "Group Leader",
      "postdoc": "Postdoctoral Researcher",
      "filter_by_year": "Filter by year:",
      "all_years": "All Years",
      "search_publications": "Search publications:",
      "show_abstract": "Show Abstract"
    },
    "teaching": {
      "title": "Teaching",
      "description": "Current and past teaching activities.",
      "intro": "Our group is actively involved in teaching at Heidelberg University. Below is a list of current and past courses, which you can manage from the CMS. For official details, please refer to the university's course catalog.",
      "instructor": "Instructor:",
      "time_location": "Time/Location:"
    },
    "members": {
      "title": "Our Research Team",
      "description": "Current and former members of our research group.",
      "intro": "Meet the dedicated researchers and staff of the AG Computational Arithmetic Geometry group at the University of Heidelberg.",
      "research_interests": "Research Interests",
      "group_leader": "Head of Research Group",
      "administrative_support": "Administrative Support",
      "research_members": "Research Members",
      "alumni": "Alumni",
      "alumni_description": "Discover our former team members and their contributions to the field.",
      "view_former_members": "View Former Members",
      "professor_group_leader": "Professor & Group Leader",
      "secretary": "Secretary",
      "postdoc": "Postdoctoral Researcher",
      "phd_student": "PhD Student",
      "boeckle_description": "Head of the research group \"Computational Arithmetic Geometry\" at the Interdisciplinary Center for Scientific Computing (IWR) in Heidelberg.",
      "cederbaum_description": "Provides administrative support for the research group, including managing correspondence, organizing meetings, and assisting with various administrative tasks.",
      "conti_description": "Research focuses on Galois representations and their deformations, particularly in the context of modular forms and elliptic curves.",
      "ferraro_description": "Research focuses on function field arithmetic, particularly Drinfeld modular forms and L-functions.",
      "chilla_description": "Research focuses on computational aspects of arithmetic geometry, particularly in the study of Galois representations and their applications.",
      "sriram_description": "Research focuses on arithmetic geometry and number theory, particularly in the study of modular forms and their connections to Galois representations.",
      "kaiser_description": "Research focuses on computational arithmetic geometry, particularly in the study of elliptic curves and their applications in cryptography.",
      "shavali_description": "Research focuses on arithmetic geometry and number theory, particularly in the study of Galois representations and their deformation theory."
    },
    "links": {
      "title": "Links",
      "description": "Useful links and resources.",
      "intro": "Here are some links that may be of interest to students and researchers, managed from the CMS."
    },
    "contact": {
      "title": "Get in Touch",
      "description": "Get in touch with our research group.",
      "intro": "We welcome inquiries from students, researchers, and collaborators interested in arithmetic geometry and computational number theory.",
      "postal_address": "Postal Address",
      "contact_details": "Contact Details",
      "office_hours": "Office Hours",
      "getting_here": "Getting Here",
      "location": "Location",
      "by_public_transport": "By Public Transport",
      "by_car": "By Car",
      "monday_friday": "Monday - Friday",
      "weekends": "Weekends",
      "closed": "Closed",
      "parking_available": "Parking available at Mathematikon building",
      "follow_signs": "Follow signs to \"IWR\" or \"Mathematikon\"",
      "building_location": "Building is located on the north side of Im Neuenheimer Feld",
      "bus_lines": "Bus: Lines 32, 33, 35 to \"Mathematikon\" stop",
      "tram_line": "Tram: Line 5 to \"Universitätsplatz\" then bus connection",
      "train": "Train: Heidelberg Hauptbahnhof, then bus connection",
      "office_hours_note": "Please note that we may be unavailable during university holidays and conference periods.",
      "phone": "Phone",
      "fax": "Fax",
      "email_note": "Click the email address to open your email client",
      "phone_hours": "Monday - Friday, 9:00 AM - 5:00 PM (CET)",
      "fax_note": "Available 24/7",
      "send_message": "Send us a Message",
      "first_name": "First Name *",
      "last_name": "Last Name *",
      "email_address": "Email Address *",
      "phone_number": "Phone Number",
      "organization": "Organization/Institution",
      "subject": "Subject *",
      "select_subject": "Please select a subject",
      "general_inquiry": "General Inquiry",
      "research_collaboration": "Research Collaboration",
      "student_information": "Student Information",
      "visiting_scholar": "Visiting Scholar",
      "seminar_conference": "Seminar/Conference",
      "other": "Other",
      "message": "Message *",
      "newsletter_subscribe": "Subscribe to our newsletter for updates on seminars and research activities",
      "form_note": "This form is powered by Google Forms. Your message will be sent directly to our team.",
      "our_location": "Our Location",
      "open_in_google_maps": "Open in Google Maps"
    },
    "resources": {
      "title": "Resources",
      "description": "Resources and tools.",
      "visit_resource": "Visit Resource",
      "no_resources": "There are no resources available at this time."
    },
    "news": {
      "title": "News",
      "description": "Latest news and announcements.",
      "read_more": "Read More"
    }
  },
  "de": {
    "nav": {
      "about": "Über uns",
      "research": "Forschung",
      "publications": "Publikationen",
      "teaching": "Lehre",
      "members": "Mitglieder",
      "links": "Links",
      "contact": "Kontakt",
      "resources": "Ressourcen",
      "news": "Neuigkeiten"
    },
    "common": {
      "search": "Suche",
      "search_placeholder": "Suchen...",
      "theme_toggle": "Theme wechseln",
      "language_switch": "Sprache wechseln",
      "skip_to_content": "Zum Hauptinhalt",
      "home": "Startseite",
      "view_all": "Alle anzeigen",
      "read_more": "Weiterlesen",
      "back_to_top": "Nach oben",
      "view_profile": "Profil anzeigen",
      "email": "E-Mail"
    },
    "header": {
      "brand_title": "AG Computational Arithmetic Geometry",
      "university_name": "Universität Heidelberg",
      "toggle_navigation": "Navigationsmenü umschalten"
    },
    "about": {
      "title": "Über uns",
      "description": "Dies ist die Website der Forschungsgruppe \"Computational Arithmetic Geometry\" am Interdisziplinären Zentrum für Wissenschaftliches Rechnen (IWR) in Heidelberg.",
      "content": "Innerhalb der algebraischen Zahlentheorie und arithmetischen Geometrie liegt der Schwerpunkt der Forschungsgruppe auf Galois-Darstellungen, ihren Beziehungen zu Modulformen und elliptischen Kurven, ihrer Deformationstheorie usw. sowie auf einigen Aspekten der Funktionenkörper-Arithmetik wie L-Funktionen und Drinfeld-Modulformen.",
      "methods": "Um Probleme in den oben beschriebenen Themen zu lösen, wenden wir eine breite Palette von Methoden an. Einerseits verfolgen wir diese Fragen mit rein theoretischen Methoden. Andererseits verwenden wir Computeralgebra, um Experimente durchzuführen, die uns helfen, Beispiele für die Theorie zu sammeln oder bestimmte Fragen zu lösen, die sich aus der Theorie ergeben. Einige Mitglieder unserer Gruppe haben auch Routinen auf Basis bestehender Computeralgebra-Pakete entwickelt.",
      "more_info": "Eine detailliertere Übersicht über unsere Aktivitäten finden Sie im Forschungsbereich und in den Publikationen unserer Mitglieder.",
      "latest_news": "Neueste Nachrichten",
      "view_all_news": "Alle Nachrichten anzeigen"
    },
    "research": {
      "title": "Forschung",
      "description": "Die Forschung unserer Gruppe liegt in der **arithmetischen Geometrie** und **Zahlentheorie**. Nachfolgend finden Sie einige unserer wichtigsten Forschungsbereiche und Themen. Für weitere Details klicken Sie auf eines der Themen, um eine detaillierte Beschreibung, verwandte Arbeiten und Ressourcen zu sehen.",
      "publications_link": "Sie können auch die [Publikationen]({{ '/publications' | relative_url }}) unserer Gruppenmitglieder durchsuchen.",
      "intro_lead": "Unsere Forschung konzentriert sich auf die Schnittstelle von arithmetischer Geometrie, Galois-Darstellungen und computergestützten Methoden in der Zahlentheorie.",
      "intro_description": "Wir untersuchen Galois-Darstellungen, Modulformen, elliptische Kurven und deren Verbindungen zur modernen Zahlentheorie. Unsere Arbeit kombiniert theoretische Erkenntnisse mit computergestützten Experimenten, um das Verständnis in diesen Bereichen voranzutreiben.",
      "areas_title": "Forschungsbereiche",
      "methodology_title": "Methodik",
      "collaborations_title": "Kooperationen",
      "collaborations_description": "Wir arbeiten mit Forschern weltweit an verschiedenen Aspekten der arithmetischen Geometrie und computergestützten Zahlentheorie zusammen. Unsere Gruppe unterhält aktive Verbindungen zu:",
      "method_computational": {
        "title": "Computergestützte Methoden",
        "description": "Wir entwickeln und verwenden fortschrittliche computergestützte Techniken, um arithmetische Objekte zu erforschen und theoretische Vorhersagen zu verifizieren."
      },
      "method_theoretical": {
        "title": "Theoretische Analyse",
        "description": "Tiefes theoretisches Verständnis leitet unsere computergestützten Experimente und hilft bei der Interpretation ihrer Ergebnisse."
      },
      "method_experimental": {
        "title": "Experimentelle Mathematik",
        "description": "Wir verwenden computergestützte Experimente, um Muster zu entdecken und neue Vermutungen in der arithmetischen Geometrie zu formulieren."
      },
      "collaboration_1": "Internationale Forschungseinrichtungen",
      "collaboration_2": "Teams für mathematische Softwareentwicklung",
      "collaboration_3": "Zahlentheorie-Konferenzen und Workshops",
      "collaboration_4": "Graduierten- und Bachelor-Forschungsprogramme",
      "learn_more": "Mehr erfahren",
      "papers_count": "Arbeiten",
      "galois_representations_title": "Galois-Darstellungen und Modulformen",
      "galois_representations_content": "Eine moderne Sichtweise auf die algebraische Zahlentheorie besteht darin, die Gruppe GQ der Symmetrien aller endlichen Erweiterungen der rationalen Zahlen Q, d.h. aller Zahlkörper, zu untersuchen. Eine Möglichkeit, dies zu tun, ist über p-adische (oder komplexe) Galois-Darstellungen. Dies sind Homomorphismen von GQ nach GLn(K) für (das komplexe oder) ein p-adisches Feld K.",
      "galois_representations_approach": "Wenn man alle diese verstehen würde, könnte man viele Ergebnisse in der Zahlentheorie ableiten. Der Grund, warum dieser Ansatz vielversprechend ist, ist, dass das Langlands-Programm vorhersagt (vermutet), dass viele interessante Galois-Darstellungen in der (arithmetischen) Geometrie gefunden werden können, zum Beispiel durch das Studium von Modulformen oder elliptischen Kurven.",
      "fermat_theorem": "Der sichtbarste Erfolg dieser Methode war der Beweis des letzten Satzes von Fermat durch Wiles und Taylor-Wiles, der auf der Arbeit vieler anderer aufbaut.",
      "drinfeld_title": "Drinfeld-Modulvarietäten und Drinfeld-Modulformen",
      "drinfeld_intro": "Es wurde beobachtet, dass Fragen in der Zahlentheorie oft Analoga über globalen Funktionenkörpern haben; dann wird der Ring der ganzen Zahlen Z durch Ringe wie den Polynomring Fp[t] ersetzt und das Feld der rationalen Zahlen Q durch das Feld der rationalen Funktionen über dem endlichen Feld Fp von p Elementen, wobei p eine Primzahl ist.",
      "drinfeld_methods": "Da Methoden aus der algebraischen Geometrie auf Funktionenkörper angewendet werden können, sind viele Fragen über letztere leichter zu behandeln als die entsprechenden Fragen über Zahlkörper. Ein besonderes Beispiel dafür ist Drinfelds Beweis der globalen Langlands-Korrespondenz für GL2 über Funktionenkörper.",
      "drinfeld_varieties": "In seinem Beweis führte Drinfeld ein, was heute Drinfeld-Modulvarietäten genannt wird; dies sind Funktionenkörper-Analoga bestimmter Shimura-Varietäten. Ihre Kohomologie führt zu Galois-Darstellungen und diese Varietäten haben eine interessante Geometrie, die aus ihrer Moduli-Interpretation stammt."
    },
    "publications": {
      "title": "Publikationen",
      "description": "Publikationen unserer Forschungsgruppenmitglieder.",
      "intro": "Publikationen und Preprints unserer Forschungsgruppe:",
      "group_members": "Gruppenmitglieder",
      "group_leader": "Gruppenleiter",
      "postdoc": "Postdoktorand",
      "filter_by_year": "Nach Jahr filtern:",
      "all_years": "Alle Jahre",
      "search_publications": "Publikationen suchen:",
      "show_abstract": "Abstract anzeigen"
    },
    "teaching": {
      "title": "Lehre",
      "description": "Aktuelle und vergangene Lehrveranstaltungen.",
      "intro": "Unsere Gruppe ist aktiv in der Lehre an der Universität Heidelberg tätig. Nachfolgend finden Sie eine Liste aktueller und vergangener Kurse, die Sie über das CMS verwalten können. Für offizielle Details konsultieren Sie bitte den Universitätskatalog.",
      "instructor": "Dozent:",
      "time_location": "Zeit/Ort:"
    },
    "members": {
      "title": "Unser Forschungsteam",
      "description": "Aktuelle und ehemalige Mitglieder unserer Forschungsgruppe.",
      "intro": "Lernen Sie die engagierten Forscher und Mitarbeiter der AG Computational Arithmetic Geometry an der Universität Heidelberg kennen.",
      "research_interests": "Forschungsinteressen",
      "group_leader": "Leiter der Forschungsgruppe",
      "administrative_support": "Administrative Unterstützung",
      "research_members": "Forschungsmitglieder",
      "alumni": "Alumni",
      "alumni_description": "Entdecken Sie unsere ehemaligen Teammitglieder und ihre Beiträge zum Fachgebiet.",
      "view_former_members": "Ehemalige Mitglieder anzeigen",
      "professor_group_leader": "Professor & Gruppenleiter",
      "secretary": "Sekretärin",
      "postdoc": "Postdoktorand",
      "phd_student": "Doktorand",
      "boeckle_description": "Leiter der Forschungsgruppe \"Computational Arithmetic Geometry\" am Interdisziplinären Zentrum für Wissenschaftliches Rechnen (IWR) in Heidelberg.",
      "cederbaum_description": "Bietet administrative Unterstützung für die Forschungsgruppe, einschließlich der Verwaltung von Korrespondenz, Organisation von Meetings und Unterstützung bei verschiedenen administrativen Aufgaben.",
      "conti_description": "Die Forschung konzentriert sich auf Galois-Darstellungen und ihre Deformationen, insbesondere im Kontext von Modulformen und elliptischen Kurven.",
      "ferraro_description": "Die Forschung konzentriert sich auf Funktionenkörper-Arithmetik, insbesondere Drinfeld-Modulformen und L-Funktionen.",
      "chilla_description": "Die Forschung konzentriert sich auf computergestützte Aspekte der arithmetischen Geometrie, insbesondere auf das Studium von Galois-Darstellungen und ihre Anwendungen.",
      "sriram_description": "Die Forschung konzentriert sich auf arithmetische Geometrie und Zahlentheorie, insbesondere auf das Studium von Modulformen und ihre Verbindungen zu Galois-Darstellungen.",
      "kaiser_description": "Die Forschung konzentriert sich auf computergestützte arithmetische Geometrie, insbesondere auf das Studium von elliptischen Kurven und ihre Anwendungen in der Kryptographie.",
      "shavali_description": "Die Forschung konzentriert sich auf arithmetische Geometrie und Zahlentheorie, insbesondere auf das Studium von Galois-Darstellungen und ihre Deformationstheorie."
    },
    "links": {
      "title": "Links",
      "description": "Nützliche Links und Ressourcen.",
      "intro": "Hier sind einige Links, die für Studierende und Forscher von Interesse sein könnten, verwaltet über das CMS."
    },
    "contact": {
      "title": "Kontakt aufnehmen",
      "description": "Kontaktieren Sie unsere Forschungsgruppe.",
      "intro": "Wir freuen uns über Anfragen von Studierenden, Forschern und Kooperationspartnern, die sich für arithmetische Geometrie und computergestützte Zahlentheorie interessieren.",
      "postal_address": "Postanschrift",
      "contact_details": "Kontaktdaten",
      "office_hours": "Öffnungszeiten",
      "getting_here": "Anfahrt",
      "location": "Standort",
      "by_public_transport": "Mit öffentlichen Verkehrsmitteln",
      "by_car": "Mit dem Auto",
      "monday_friday": "Montag - Freitag",
      "weekends": "Wochenenden",
      "closed": "Geschlossen",
      "parking_available": "Parkplätze verfügbar im Mathematikon-Gebäude",
      "follow_signs": "Folgen Sie den Schildern zu \"IWR\" oder \"Mathematikon\"",
      "building_location": "Das Gebäude befindet sich auf der Nordseite des Im Neuenheimer Feld",
      "bus_lines": "Bus: Linien 32, 33, 35 zur Haltestelle \"Mathematikon\"",
      "tram_line": "Straßenbahn: Linie 5 zum \"Universitätsplatz\" dann Busverbindung",
      "train": "Zug: Heidelberg Hauptbahnhof, dann Busverbindung",
      "office_hours_note": "Bitte beachten Sie, dass wir während der Universitätsferien und Konferenzzeiten möglicherweise nicht erreichbar sind.",
      "phone": "Telefon",
      "fax": "Fax",
      "email_note": "Klicken Sie auf die E-Mail-Adresse, um Ihren E-Mail-Client zu öffnen",
      "phone_hours": "Montag - Freitag, 9:00 - 17:00 Uhr (MEZ)",
      "fax_note": "24/7 verfügbar",
      "send_message": "Nachricht senden",
      "first_name": "Vorname *",
      "last_name": "Nachname *",
      "email_address": "E-Mail-Adresse *",
      "phone_number": "Telefonnummer",
      "organization": "Organisation/Institution",
      "subject": "Betreff *",
      "select_subject": "Bitte wählen Sie einen Betreff",
      "general_inquiry": "Allgemeine Anfrage",
      "research_collaboration": "Forschungskooperation",
      "student_information": "Studenteninformation",
      "visiting_scholar": "Gastwissenschaftler",
      "seminar_conference": "Seminar/Konferenz",
      "other": "Sonstiges",
      "message": "Nachricht *",
      "newsletter_subscribe": "Abonnieren Sie unseren Newsletter für Updates zu Seminaren und Forschungsaktivitäten",
      "form_note": "Dieses Formular wird von Google Forms bereitgestellt. Ihre Nachricht wird direkt an unser Team gesendet.",
      "our_location": "Unser Standort",
      "open_in_google_maps": "In Google Maps öffnen"
    },
    "resources": {
      "title": "Ressourcen",
      "description": "Ressourcen und Werkzeuge.",
      "visit_resource": "Ressource besuchen",
      "no_resources": "Derzeit sind keine Ressourcen verfügbar."
    },
    "news": {
      "title": "Neuigkeiten",
      "description": "Neueste Nachrichten und Ankündigungen.",
      "read_more": "Weiterlesen"
    }
  }
} 